import 'package:flutter/material.dart';

class Story {
  final String title; // e.g., 'الجملة الأولى'
  final String content;

  Story({required this.title, required this.content});
}


final Map<String, List<Story>> StoryByLetter = {

  'أ': [
    Story(title: 'أرنب أسماء ', content: 'عند أسماء أرنب أبيض تحبه وتهتم فيه. يابت أسماء الجزر وأوراق الخس وقعد ياكل الأرنب. عطت الأرنب الماي وشرب الأرنب. صار الأرنب صديق أسماء المفضل.'),
  ],

  'ب': [
    Story(
      title: 'نفنوف رباب',
      content:
          'بيت رباب فيه حمام سباحه. ونفنوف رباب باللون الوردي. طلع اخوها بدر من حمام السباحه، وبلل نفنوف رباب بالماي. زعلت رباب وراحت بدلت نفنوفها.',
    ),
  ],

  'ت': [
    Story(
      title: 'تالا والفراشه',
      content:
          'راحت تالا تلعب في حديقة البيت. شافت فراشة ملونة تطير فوق الورد. استانست تالا، وحاولت انها تمسك الفراشة. طارت الفراشة، وزعلت تالا. قالت لها أمها: الفراشة تحب الحرية يا تالا.',
    ),
  ],

  'ث': [
    Story(
      title: 'مثلثات ثامر',
      content:
          'فتح ثامر باب الثلاجة، وطلع علبة مثلثات الجبن. لعب ثامر بمثلثات الجبن ورتبهم كل ثلاث مع بعض. قال ثامر: ماما سويت وردات من مثلثات الجبن. قالت ماما: مثلثات الجبن ناكلها، ما نلعب فيها.',
    ),
  ],

  'ج': [
    Story(
      title: 'مزرعة جاسم',
      content:
          'في مزرعة جاسم أرانب تحب الجزر، ودجاج يحب الحبوب. وصل جاسم المزرعة، وما لقى الدجاجة البيضا. طلع جاسم يدور الدجاجة البيضا عند الشجر. لقى جاسم الدجاجة البيضا ويمها بيضة. استانس جاسم ورجع للمزرعة.',
    ),
  ],

  'ح': [
    Story(
      title: 'أحب أروح المزرعة',
      content:
          'في المزرعة نقعد الصبح مبجر. ناخذ التفاح من شجرة التفاح. نعطي الحمام أكل، يحبون ياكلون حبوب القمح. ونعطي الحصان الأكل.',
    ),
  ],

  'خ': [
    Story(
      title: 'كوخ خالد',
      content:
          'طلع خالد من الكوخ. قعد يجمع الخس و الخيار. شاف الخروف و عطاه خس.',
    ),
  ],

  'د': [
    Story(
      title: 'دفتر زياد',
      content:
          'عند زياد دفتر يديد. بالمدرسة قعد يرسم بالدفتر. رسم زياد وردة و دب.',
    ),
  ],

  'ذ': [
    Story(
      title: 'القنفذ والذيب',
      content:
          'كان القنفذ يلعب بمزرعة الذرة الصفرا. سمع صوت ينادي: سااعدوني ذيلي ساعدووني ! راح القنفذ حق مكان الصوت، وساعد الذيب. شكر الذيب القنفذ لان ساعده وراح البيت.',
    ),
  ],

  'ر': [
    Story(
      title: 'إشارة المرور',
      content:
          'إشارة المرور حمرا. وقفت كل السيارات. بعدين صار لونها اخضر. مشت السيارات وعبرت الشارع. إشارة المشاة حمرا. وقف رامي على الرصيف. صارت إشارة المشاة خضرا. قدر رامي انه يعبر الشارع.',
    ),
  ],

  'ز': [
    Story(
      title: 'الزرافة و الغزال',
      content:
          'غزال صغير يمشي مع زرافة صغيرة في الغابة. شاف الغزال الصغير عصفور صغير بين الورد. شال الغزال العصفور، وحطه على راس الزرافة. رفعت الزرافة راسها، ورجع العصفور حق العش مستانس.',
    ),
  ],

  'س': [
    Story(
      title: 'حصان فراس',
      content:
          'وقف حصان فراس عند السور ينطر الماي والاكل. ياب فراس الخس والماي، وقعد يوكل الحصان. ركب فراس الحصان، ونط فوق السور. فاز الحصان بالسباق، واستانس فراس.',
    ),
  ],

  'ش': [
    Story(
      title: 'الفراشة المحبوبة',
      content:
          'طلعت الشمس الصبح، وطارت الفراشة فوق الورد. شافت الفراشة عصفور في العش، قالت له: صباح الخير. شافت الفراشة الخروف ياكل العشب، فقالت له: صباح الخير. شافت الفراشة صديقاتها الفراشات تحت الشجر، استانست، وقالت لهم: صباح الخير. يلا نروح نلعب.',
    ),
  ],

  'ص': [
    Story(
      title: 'صندوق صابر',
      content:
          'يمع صابر صدف البحر داخل الصندوق. غسل صابر الصدف بالماي والصابون. لون صابر الصدف، ولصقه على الصندوق، وسوى عصفور اصفر من الصدف. لصق العصفور الأصفر على الصندوق، وعطاه حق صديقه هدية.',
    ),
  ],

  'ض': [
    Story(
      title: 'دياية راضي',
      content:
          'باضت دياية راضي ثلاث بيضات. اخذ راضي البيض ووراه امه واهو يضحك. طاحت بيضة على الأرض وعصبت ام راضي. قال راضي لامه: لا تعصبين راح انتبه المره اليايه.',
    ),
  ],

  'ط': [
    Story(
      title: 'بحيرة طارق',
      content:
          'رسم طارق بحيرة، ورسم اخطبوط يسبح في البحيرة. رسم طارق ولد شايل بطريق، ويعطي الاخطبوط اكل. ورسم طارق بطة كبيره في البحيرة.',
    ),
  ],

    'ظ': [
    Story(
      title: 'احمد والفصول',
      content:
          'في فصل الصيف، يلبس احمد نظارة شمسية. في فصل الخريف، ينظف احمد الحديقة من أوراق الشجر اللي طايحه عالارض. في فصل الشتاء، يمسك احمد مظلة، ويمشي تحت المطر. في فصل الربيع عند احمد منظار، ويشوف فيه الفراشات.',
    ),
  ],

  'ع': [
    Story(
      title: 'ضفدع عدنان',
      content:
          'عند عدنان ضفدع صغير يحبه ويلعب معاه. حط عدنان الضفدع في علبة، وحط العلبة في صندوق الألعاب. دز عدنان الصندوق، طاحت العلبة و الألعاب على الأرض. نط الضفدع على صبع عدنان. ضحك عدنان ورجع الألعاب داخل الصندوق.',
    ),
  ],

  'غ': [
    Story(
      title: 'غازي والغراب',
      content:
          'بيت غازي قريب من الغابة الخضرا. غازي يصبغ السور، وقاعدين يشوفونه الغزال والكنغر. وقف الغراب عند الصبغ وقعد يصرخ. راح غازي داخل البيت وياب اكل وماي حق الغراب والغزال والكنغر.',
    ),
  ],

  'ف': [
    Story(
      title: 'خروف فواز',
      content:
          'فواز يلعب مع الخروف الصغير تحت الشجرة. العصفورة قاعدة تعطي عصافيرها الصغار الاكل فوق الشجرة. قام فواز واخذ فلفل اخضر، ويبي يوكل الخروف. لف ويها الخروف ورفض ياكل وقعد يصرخ.',
    ),
  ],

  'ق': [
    Story(
      title: 'ذكاء القطوة',
      content:
          'وقفت القطوة بسوق السمج، وقعدت تشوف السمج اللي موجود بالسلة. نطت القطوة على سلة السمج وحاولت تأخذ سمجه. ما قدرت، وطاحت على الأرض. فكرت القطوة، بعدين وقفت على كرسي يم السلة عشان تقدر توصل للسمج. انتبه صاحب المحل للقطوة وحاول يوخرها بس طاح على الأرض، وضحكت القطوة.',
    ),
  ],

  'ك': [
    Story(
      title: 'السباق',
      content:
          'الكنغر وطير الكناري كانوا مشاركين في سباق الحيوانات. مسكت البطة الساعة، وصاحت: كواك .. كواك بدا السباق. صاحت البطة: بسرعة يا ديج .. انقز يا كنغر، طير الكناري كان سابقهم. فااز طير الكناري بالسباق، كان الأسرع، استانس وقال: انا الأول.',
    ),
  ],

  'ل': [
    Story(
      title: 'عسل النحل',
      content:
          'طار النحل فوق الورود الملونة. رجع النحل الى خلية النحل، وبدا يصنع النحل. شرب باسل الحليب مع العسل، وكلت ليلى الموزة مع العسل. قالت ماما: العسل مفيد. طعمه حلو ولذيذ.',
    ),
  ],

  'م': [
    Story(
      title: 'مرام في المطعم',
      content:
          'قعدت مرام مع ماما في المطعم تحت المظلة. كلت مرام وجبة السمج، بعدين كلت موزة. عطت مرام سمج حق قطوة صغيرة. شالت مرام لعبتها وراحت مع ماما للبيت.',
    ),
  ],

  'ن': [
    Story(
      title: 'يوميات حنان',
      content:
          'حنان تحب الجبن مع الخبز والزيتون. وتغسل ايدها بالماي والصابون. وتنظف اسنانها بالفرشة والمعجون. تلبس حنان البجامه بليل وقت النوم، وتقول حق ماما وبابا: تصبحون على خير.',
    ),
  ],

  'ه': [
    Story(
      title: 'لعبة هدى وهشام',
      content:
          'لعب هشام مع اخته هدى لعبة كرة القدم. شات هشام الكرة ثلاث مرات، وياب قول بس مره وحده. خذت هدى الكره وشاتتها ثلاث مرات، ويابت قول مره وحده. قال هشام: لازم نتدرب على لعبة كره القدم.',
    ),
  ],

  'و': [
    Story(
      title: 'بالون نور',
      content:
          'وزعت الابله بالونات ملونه على الأطفال، وقالت: يلا نلعب لعبة البالونات. نفخ كل واحد بلونه، وربطه بخيط طويل بريوله. لعب الأطفال وكل واحد كان يحاول يبط بلونه رفيجه. بقى بالونه نور محد قدر يبطها. استانست نور، وصفق لها الأطفال.',
    ),
  ],

  'ي': [
    Story(
      title: 'الارنب والفيل',
      content:
          'كان الفيل يمشي، وشايل الارنب الصغير على ظهره. طاح الارنب الصغير في صندوق ماي، وقعد يبجي. حط الفيل خرطومه في الصندوق، وطلع الماي من الصندوق. الارنب الصغير قال حق الفيل: شكرا ، وقعد على ظهره مره ثانيه.',
    ),
  ],


};